
//头文件 #include <afxdisp.h>

//=====================================
//	double转化为字符串
//=====================================

//40250.519386574073	转化为时间	"2010-03-13 12:27:55"
COleDateTime time=40250.519386574073;

CString str = time.Format(_T("%Y-%m-%d %H:%M:%S"));

//=====================================
//	字符串转化为double
//=====================================
COleDateTime t;

t.SetDateTime(2000, 2, 29, 5, 0, 0);
double dTime=t;

//=====================================
//	获得当前的系统时间
//=====================================
COleDateTime time=COleDateTime::GetCurrentTime();